Data Frame - Conditional Selection

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [24]:
#### creating a data frame

my_df_cond = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [25]:
my_df_cond

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [28]:
booldf_cond = my_df_cond>0.6
print(booldf_cond)

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C   True  False  False  False
D  False  False  False   True
E  False   True  False   True

In [31]:
my_df_cond[booldf_cond]

          W         X   Y         Z
A       NaN       NaN NaN       NaN
B  1.025984       NaN NaN  0.649826
C  2.154846       NaN NaN       NaN
D       NaN       NaN NaN  1.024810
E       NaN  1.862864 NaN  0.610478

In [36]:
### multiple conditions using and
my_df_cond[(my_df_cond>0.1) & (my_df_cond<0.8)]

          W       X         Y         Z
A       NaN  0.1968       NaN       NaN
B       NaN     NaN       NaN  0.649826
C       NaN     NaN       NaN       NaN
D  0.147027     NaN  0.558769       NaN
E       NaN     NaN       NaN  0.610478

In [37]:
### multiple conditions using or 

my_df_cond[(my_df_cond>0.1) | (my_df_cond<0.8)]

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [34]:
my_df_cond

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [13]:
### operators - conditional selection- comparison operator
### select all values from data frame that are greater than 0

my_df_cond = my_df_cond>0.1
print(my_df_cond)
print(type(my_df_cond))

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True
<class 'pandas.core.frame.DataFrame'>

In [14]:
my_df_cond

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [40]:
my_df_cond
#### output will be a boolean data frame

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [42]:
#### using bracket notation, we can get only the rows where this cond is satisfied
### grab only rows of col W where its >0 
my_df_cond[my_df_cond['W']>0]

#### remember that the result just ignored the row with C as index. 
### Note that the row 'C' with "NaN" value was left out beecause W > 0 failed there

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [44]:
#### grab all the rows where Z< 0.6
my_df_cond[my_df_cond['Z'] < 0.6]

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
C  2.154846 -0.610259 -0.755325 -0.346419

In [46]:
my_df_cond

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [45]:
### assigning conditional operations on data frame to a variable
resultdf=my_df_cond[my_df_cond['W']>0] 

print('/n')

### print result set- which itself is a dataframe. meaning i can do other operations on this resultset
print(resultdf)

/n
          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [48]:
##### extracting data from the above resultset - eg extract column X from result set
my_df_cond[my_df_cond['W']>0.6][['W','X','Y']]

          W         X         Y
B  1.025984 -0.156598 -0.031579
C  2.154846 -0.610259 -0.755325

In [50]:
my_df_cond[my_df_cond['X']>0.6][['X','W','Z']]

          X         W         Z
E  1.862864 -0.925874  0.610478

In [19]:
 #### alternate way to extract data from a result set of a conditional op on a data frame
df1[df1['W']>0]['X']

A     True
B    False
D    False
E     True
Name: X, dtype: bool

In [20]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 
#### note double bracket notation indicating multiple col extraction

df1[df1['W']>0]  [['X','Y']]  




####

       X      Y
A   True   True
B  False  False
D  False  False
E   True   True

In [21]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 

df1
#### note double bracket notation indicating multiple col extraction

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
##### multiple conditions column extraction

In [55]:
my_df_cond[(my_df_cond['W']>0) & (my_df_cond['Y']>0)] [['W','X','Y','Z']]  

### we get an error that "truth values of series ambiguous"
## and operator can return only single boolean values at a time. but for an entire series of boolean values, it will be confused and so 
### we use the "&"

          W         X         Y        Z
D  0.147027 -0.479448  0.558769  1.02481

In [58]:
my_df_cond.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [24]:
(df1['W']>0) & (df1['Y']>1)

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [25]:
df1[(df1['W']>0) & (df1['Y']>1)]     #### & operator equivalent to and. using and will give an error

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [26]:
df1[(df1['W']>0) | (df1['Y']>1)]     ##### | operator equivalent to or

      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
D  True  False  False  True
E  True   True   True  True

In [125]:
df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [68]:
df1

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [60]:
### INDEX MANIPULATION

In [69]:
df1.reset_index()  #### resets index, but not inplace reset

### NOTE - User defined index is showing as another column "index"

  index         W         X         Y         Z
0     A  1.606780 -1.115710 -1.385379 -1.329660
1     B  0.041460 -0.411055 -0.771329  0.110477
2     C -0.804652  0.253548  0.649148  0.358941
3     D -1.080471  0.902398  0.161781  0.833029
4     E  0.975720 -0.388239  0.783316 -0.708954

In [71]:
df1
### displaying the data frame, reveals that index is not reset. this is because of "inplace" parameter is False by default

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [73]:
df1.reset_index(drop=True) ### will reset the index permanently

          W         X         Y         Z
0  1.606780 -1.115710 -1.385379 -1.329660
1  0.041460 -0.411055 -0.771329  0.110477
2 -0.804652  0.253548  0.649148  0.358941
3 -1.080471  0.902398  0.161781  0.833029
4  0.975720 -0.388239  0.783316 -0.708954

In [126]:
df1

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [75]:
df1.reset_index(drop=True,inplace=True) ### will reset the index permanently

In [131]:
 df1

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [144]:
#### define a data frame
mydf100 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])
mydf100

          W         X         Y         Z
A -1.306482 -1.632924  0.802129 -1.667537
B  0.608857  0.286473 -0.205792  2.493990
C -0.547260  0.496727 -1.235614 -0.798428
D  0.754121 -0.772041 -0.034432  0.688408
E  0.081523 -0.415191  0.053661 -2.115113

In [145]:
### add a new column from a strong
newstring = 'CA NY NJ OH CO'  ### define a string
newcolx =newstring.split()    ## split the string to create a list of 5 items
print(newcolx)

['CA', 'NY', 'NJ', 'OH', 'CO']

In [146]:
### add the list newcolx to the dataframe mydf100 in a column called "States"
mydf100['States'] = newcolx
print(mydf100)
### note new col States has been created with the values from list newcolx

          W         X         Y         Z States
A -1.306482 -1.632924  0.802129 -1.667537     CA
B  0.608857  0.286473 -0.205792  2.493990     NY
C -0.547260  0.496727 -1.235614 -0.798428     NJ
D  0.754121 -0.772041 -0.034432  0.688408     OH
E  0.081523 -0.415191  0.053661 -2.115113     CO

In [147]:
### set the index of dataframe to column States
mydf100.set_index('States',inplace=True)

### note that the column States has become the index -- but this is not a permanent change

In [148]:
mydf100 

### displaying mydf100 tells us that States has still not been set as index. why?
### inplace = False in set_index method

               W         X         Y         Z
States
CA     -1.306482 -1.632924  0.802129 -1.667537
NY      0.608857  0.286473 -0.205792  2.493990
NJ     -0.547260  0.496727 -1.235614 -0.798428
OH      0.754121 -0.772041 -0.034432  0.688408
CO      0.081523 -0.415191  0.053661 -2.115113

In [143]:
### set inplace= True in the set_index method

In [149]:
### revert back to default index
mydf100.reset_index()

  States         W         X         Y         Z
0     CA -1.306482 -1.632924  0.802129 -1.667537
1     NY  0.608857  0.286473 -0.205792  2.493990
2     NJ -0.547260  0.496727 -1.235614 -0.798428
3     OH  0.754121 -0.772041 -0.034432  0.688408
4     CO  0.081523 -0.415191  0.053661 -2.115113

In [127]:
df1

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [78]:
#### adding a new column to data frame 
### set that column as index

In [128]:
newstring = 'CA NY NJ OH CO'

In [129]:
newx = newstring.split()

In [130]:
newx

['CA', 'NY', 'NJ', 'OH', 'CO']

In [119]:
df1['States'] = newx
df1

               W         X         Y         Z States
States
CA      1.606780 -1.115710 -1.385379 -1.329660     CA
NY      0.041460 -0.411055 -0.771329  0.110477     NY
NJ     -0.804652  0.253548  0.649148  0.358941     NJ
OH     -1.080471  0.902398  0.161781  0.833029     OH
CO      0.975720 -0.388239  0.783316 -0.708954     CO

In [122]:
df1.set_index('States')

### column states has now become index

               W         X         Y         Z
States
CA      1.606780 -1.115710 -1.385379 -1.329660
NY      0.041460 -0.411055 -0.771329  0.110477
NJ     -0.804652  0.253548  0.649148  0.358941
OH     -1.080471  0.902398  0.161781  0.833029
CO      0.975720 -0.388239  0.783316 -0.708954

In [123]:
df1
### note that States is not index because inplace=False

               W         X         Y         Z States
States
CA      1.606780 -1.115710 -1.385379 -1.329660     CA
NY      0.041460 -0.411055 -0.771329  0.110477     NY
NJ     -0.804652  0.253548  0.649148  0.358941     NJ
OH     -1.080471  0.902398  0.161781  0.833029     OH
CO      0.975720 -0.388239  0.783316 -0.708954     CO

In [ ]:
#### difference between reset and set index is
#### reset index resets to new index and makes the old index as a column in the data frame
#### set index completely overrides the old index
### note both reset and set will become permanent ONLY when using INPLACE argument

In [158]:
df1

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [162]:
#### EXTRACTS rows using conditions
resultdf_rows = df1.loc['A'] > 0.3
resultdf_rows
### df1[resultdf_rows]
#### need to come back on this!!!

W     True
X    False
Y     True
Z    False
Name: A, dtype: bool